Tekla.Structures.Model.BentPlateGeometrySolver
BentPlateGeometrySolver is a solver class to handle ConnectiveGeometry modification related computations.
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
var contour1 = new Contour();
contour1.AddContourPoint(new ContourPoint(new Point(6000.0, 8500.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(6000.0, 6000.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(12000.0, 6000.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(12000.0, 8500.0, 0.0), null));
var geometry = new ConnectiveGeometry(contour1);
var contour2 = new Contour();
contour2.AddContourPoint(new ContourPoint(new Point(15000.0, 8500.0, 1000.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(15000.0, 6000.0, 1000.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(19600.0, 6000.0, 3500.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(19600.0, 8500.0, 3500.0), null));
var radius = 2000.0;
var bentPlateGeometrySolver = new BentPlateGeometrySolver();
var newGeometry = bentPlateGeometrySolver.AddLeg(geometry, contour2, radius);
}

Tekla.Structures.Model.BentPlateGeometrySolver.#ctor
Initializes a new instance of the BentPlateGeometrySolver class.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour,Tekla.Structures.Model.BentPlate.BendShape)
Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection, or
the maximum cone aperture for conical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: The polygonal contour to add to geometry.
bendShape: Shape of the bend that connects the leg
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour)
Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: The polygonal contour to add to geometry.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour,System.Double)
Appends a polygon section to this ConnectiveGeometry, using the specified radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: the polygonal contour to add to this geometry
radius: the specified radius for the connecting cylindrical section
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour,System.Double,System.Double)
Joins a polygon section to this ConnectiveGeometry, using the specified radius and aperture for the conical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: the polygonal contour to add to this geometry
largestRadius: The specified largest radius for the connecting conical section.
halfAperture: The angle between the cone generatrix and any of its generator lines.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.BentPlate.BendShape)
Appends a polygon section to this ConnectiveGeometry, using the specified connection points and maximal
radius for the cylindrical connection, or maximum aperture for conical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: the two connection points on this instance geometry
polygon: the polygonal contour to add to this geometry
segment2: the two connection points on polygon geometry
bendShape: Shape of the bend that connects the leg
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment)
Appends a polygon section to this ConnectiveGeometry, using the specified connection points and maximal radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: the two connection points on this instance geometry
polygon: the polygonal contour to add to this geometry
segment2: the two connection points on polygon geometry
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Appends a polygon section to this ConnectiveGeometry, using the specified connection points and radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: the two connection points on this instance geometry
polygon: the polygonal contour to add to this geometry
segment2: the two connection points on polygon geometry
radius: the specified radius for the connecting cylindrical section
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment,System.Double,System.Double)
Joins a polygon section to this ConnectiveGeometry, using the specified connection points and radius
and aperture for the conical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: The two connection points on this instance geometry.
polygon: the polygonal contour to add to this geometry
segment2: The two connection points on polygon geometry.
largestRadius: The specified largest radius for the connecting conical section.
halfAperture: The angle between the cone generatrix and any of its generator lines.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when geometry is a stand-alone bend geometry, meaning
that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.RemoveLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection)
Removes a polygon section which is the end section, from this ConnectiveGeometry including extensions and cylindrical surface.
geometry: ConnectiveGeometry used to remove a connection.
legSection: Leg GeometrySection to remove.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws System.ArgumentException: Thrown when the supplied legSection is invalid leg section
or geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.Split(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection)
Returns the resulting geometry or geometries when a section and the related automatically created sections are removed from this geometry.
geometry: ConnectiveGeometry used for split operation.
geometrySection: GeometrySection to remove.
Returns: The resulting geometries once the section and related automatic sections are removed.
Throws System.ArgumentException: Thrown when the supplied geometrySection is invalid
or geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyBendSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.BendSurface)
Modifies the shape of a bend surface section, and updates related polygon sections accordingly.
geometry: Reference geometry to modify which contains cylindricalSection.
bendSection: Geometry section to modify.
surface: The modified bend surface for the section.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify the bend surface.

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)
Modifies the shape of a cylindrical surface section, and updates related polygon sections accordingly.
Remarks:  Identical to Tekla.Structures.Model.BentPlateGeometrySolver.ModifyBendSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.BendSurface)

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyRadius(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,System.Double)
Modify the radius of a cylindrical section.
geometry: Reference geometry to modify which contains cylindricalSection.
cylindricalSection: The cylindrical geometry section to modify.
radius: The new radius for the cylindrical section.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify radius.

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyConicalRadiuses(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,System.Double,System.Double)
Modify the radiuses of a conical section, preserving the length of the side boundaries. The order of the
provided radiuses is not relevant, as the cone vertex will be located on the same side of the plates as
the original cone section.
geometry: Reference geometry to modify which contains conicalSection.
conicalSection: The conical geometry section to modify.
radius1: New radius one of the cross sections of the cone.
radius2: New radius of the other cross section of the cone.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify the geometry.

Tekla.Structures.Model.BentPlateGeometrySolver.ScaleConeSection(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,System.Double)
Scale the shape of a conical section.
geometry: Reference geometry to modify which contains conicalSection.
conicalSection: The conical geometry section to modify.
scale: Scale to apply to the conical section (greater than 0).
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify the geometry.

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyPolygon(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.Contour)
Modify the shape of a polygon section, and updates related cylindrical sections accordingly.
geometry: Reference geometry to modify which contains polygonSection.
polygonSection: A polygon section from geometry to modify.
points: The modified contour for the section.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify polygon.

Tekla.Structures.Model.BentPlateGeometrySolver.SetMainSection(Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.ConnectiveGeometry)
Sets newMainSection as a main section of geometry.
newMainSection: Geometry section to set as main section.
geometry: Connective geometry to modify.
Returns: Connective geometry with newMainSection as main section.
Throws System.ArgumentException: Throws an System.ArgumentException exception
if the input newMainSection is not a polygon section.

Tekla.Structures.Model.BentPlateGeometrySolver.SetBendAngle(System.Double,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.ConnectiveGeometry)
Sets angle as the angle of curved section sectionToSetAngle
and modifies geometry starting from sectionToMove.
angle: Angle in degrees to set.
sectionToSetAngle: Curved section to set angle value.
sectionToMove: Could be curved or plate section, used to know which side of chain to modify.
geometry: Geometry of the bent plate to modify.
Returns: Returns modified geometry with on success or initial geometry on fail.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.BentPlate.BendShape)
Joins another ConnectiveGeometry to this instance, using the maximum radius for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
geometryToAdd: the geometry instance to be joined to this
bendShape: Shape of the bend that connects the leg
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry,System.Double)
Joins another ConnectiveGeometry to this instance, using the specified radius for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
geometryToAdd: The geometry instance to be joined to this one.
radius: The specified radius for the connecting cylindrical section.
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry,System.Double,System.Double)
Joins another ConnectiveGeometry to this instance, using the specified radius and aperture for the conical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
geometryToAdd: The geometry instance to be joined to this one.
largestRadius: The specified largest radius for the connecting conical section.
halfAperture: The angle between the cone generatrix and any of its generator lines.
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.BentPlate.BendShape)
Joins another ConnectiveGeometry to this instance, using the specified connection points for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
segment1: The two connection points on this instance geometry.
geometryToAdd: The geometry instance to be joined to this one.
segment2: The two connection points on polygon geometry.
bendShape: Shape of the bend that connects the leg
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Joins another ConnectiveGeometry to this instance, using the specified connection points and radius for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
segment1: The two connection points on this instance geometry.
geometryToAdd: The geometry instance to be joined to this one.
segment2: The two connection points on polygon geometry.
radius: The specified radius for the connecting cylindrical section.
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double,System.Double)
Joins another ConnectiveGeometry to this instance, using the specified connection points and radius
and aperture for the conical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
segment1: The two connection points on this instance geometry.
geometryToAdd: The geometry instance to be joined to this one.
segment2: The two connection points on polygon geometry.
largestRadius: The specified largest radius for the connecting conical section.
halfAperture: The angle between the cone generatrix and any of its generator lines.
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.TransformPointToGlobal(Tekla.Structures.Geometry3d.Point)
Return point in global coordinate system.
point: Point to transform.
Returns: Return point in global coordinate system.

Tekla.Structures.Model.BentPlateGeometrySolver.IsStandAloneGeometry(Tekla.Structures.Model.ConnectiveGeometry)
Checks if the given geometry is stand-alone bent plate or not.
geometry: Geometry to check.
Returns: True if the given geometry is stand-alone geometry, false otherwise.

Tekla.Structures.Model.BentPlateGeometrySolver.ThrowConnectiveGeometryException(Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus)
Throws an exception based on status
status: Result error status of the creation/modification of connective geometry instance.